In [45]:

import pandas as pd
import numpy as np
df=pd.DataFrame({ 'month' : [10,11,12,1,2,3],
                  'temp'  : [65,50,45,np.nan,np.nan,np.nan] }).set_index('month')

In [46]:
df

       temp
month
10     65.0
11     50.0
12     45.0
1       NaN
2       NaN
3       NaN

In [47]:
df['SMA2']  = df['temp'].rolling(3,center=False,min_periods=1).mean()

In [48]:
df

       temp       SMA2
month
10     65.0  65.000000
11     50.0  57.500000
12     45.0  53.333333
1       NaN  47.500000
2       NaN  45.000000
3       NaN        NaN

In [49]:
df['SMA2']  = df['temp'].rolling(3,center=True,min_periods=1).mean()

In [50]:
df

       temp       SMA2
month
10     65.0  57.500000
11     50.0  53.333333
12     45.0  47.500000
1       NaN  45.000000
2       NaN        NaN
3       NaN        NaN